import type { Book } from '../types/Book'

export const books: Book[] = [
    {
        id: "1",
        title: "1984",
        genres: ["Антиутопия", "Драма", "Политический"],
        subtitle: "Роман",
        author: "Джордж Оруэлл",
        coAuthors: "",
        language: "Русский",
        translator: "Виктор Голышев",
        date_of_publication: "1949",
        description: "Антиутопический роман о тоталитарном обществе, тотальном контроле и борьбе человека за свободу.",
        rating: "4.8",
        note: "Сильная и атмосферная книга. Особенно интересны темы контроля и свободы.",
        status: "Закончено",
        tag: "Любимые"
    },

    {
        id: "2",
        title: "Гарри Поттер и философский камень",
        genres: ["Фэнтези", "Приключения", "Мистика"],
        subtitle: "Книга первая",
        author: "Дж. К. Роулинг",
        coAuthors: "",
        language: "Русский",
        translator: "Мария Спивак",
        date_of_publication: "1997",
        description: "История юного Гарри Поттера, который узнаёт о своём магическом происхождении и поступает в школу волшебства Хогвартс.",
        rating: "4.9",
        note: "Лёгкая и атмосферная книга, которую приятно перечитывать.",
        status: "Закончено",
        tag: "Перечитать"
    },

    {
        id: "3",
        title: "Преступление и наказание",
        genres: ["Роман", "Драма", "Психология", "Философия"],
        subtitle: "Психологический роман",
        author: "Фёдор Достоевский",
        coAuthors: "",
        language: "Русский",
        translator: "",
        date_of_publication: "1866",
        description: "История Родиона Раскольникова, совершившего преступление и столкнувшегося с последствиями своего поступка.",
        rating: "4.7",
        note: "Много философских и психологических размышлений.",
        status: "Закончено",
        tag: "В планах"
    },

    {
        id: "4",
        title: "Шерлок Холмс: Собака Баскервилей",
        genres: ["Детектив", "Мистика", "Триллер", "Приключения"],
        subtitle: "Повесть",
        author: "Артур Конан Дойл",
        coAuthors: "",
        language: "Русский",
        translator: "",
        date_of_publication: "1902",
        description: "Шерлок Холмс расследует таинственную смерть и легенду о сверхъестественной собаке, преследующей род Баскервилей.",
        rating: "4.6",
        note: "Интересная детективная загадка и мрачная атмосфера.",
        status: "Закончено",
        tag: "Любимые"
    },

    {
        id: "5",
        title: "Дюна",
        genres: ["Научная фантастика", "Приключения", "Политический", "Драма"],
        subtitle: "Хроники Дюны",
        author: "Фрэнк Герберт",
        coAuthors: "",
        language: "Русский",
        translator: "Мария Гальперина",
        date_of_publication: "1965",
        description: "История Пола Атрейдеса и его семьи на пустынной планете Арракис, где находится важнейший ресурс галактики.",
        rating: "4.9",
        note: "Большой мир, политика, религия и борьба за власть.",
        status: "Приостановлено",
        tag: "Перечитать"
    },

    {
        id: "6",
        title: "Оно",
        genres: ["Ужасы", "Триллер", "Мистика", "Драма"],
        subtitle: "Роман",
        author: "Стивен Кинг",
        coAuthors: "",
        language: "Русский",
        translator: "",
        date_of_publication: "1986",
        description: "Группа друзей сталкивается с древним существом, которое принимает форму их самых сильных страхов.",
        rating: "4.5",
        note: "Мрачная атмосфера и хорошо раскрытые персонажи.",
        status: "Незавершенна",
        tag: "Брошено"
    }
]
